MKS-01/lokalgrid/firmware/sdkconfig.defaults
# Lokalgrid — pinned build configuration (PROJECT.md section 5)

CONFIG_IDF_TARGET="esp32s3"

# Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# PSRAM — S3 module is octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# Console + logs over the built-in USB-JTAG (same cable as flashing)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Power
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# BLE — NimBLE, multi-connection is the whole point
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3

# WiFi SoftAP — 3 clients + rejoin headroom
CONFIG_ESP_WIFI_SOFTAP_MAX_STA=4

# HTTP server with WebSocket
CONFIG_HTTPD_WS_SUPPORT=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
